# TileBrickColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Tile..::..TileBrickColor Property
Tile Class See Also
---
The property labeled "Tile Color" from the "Tile" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string TileBrickColor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TileBrickColor As String
	Get
```

Visual C++
---
```text
public:
static property String^ TileBrickColor {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
# See Also
Tile Class
Autodesk.Revit.DB.Visual Namespace